
const 世界地図の文字列 = 
`#                                                                             ####     ####
##         ##                    #                                         ####  ##########
#                        ######################                     ####  # #####    ######
          ## #######################################     ##################      #    ##   
      #   # ##############################     #                 ############  #####       
       #####################################                       ##################      
       ####################################                        ######### #####         
      ##  #####   ## ####################   ##                     ##############          
     ##       ###### ################# #    ##                      ############           
     ##       ###### ################# #   ##                       ############           
      ####      ######################   ###                        ###########            
     #########  ######################  ##                           #########             
    ################ #################                                 ###                 
    ############ #####   ############                                   ##                 
   #################      ##    ###                                        ##              
    ###############        #      #                                             #          
    ################                                                           #####       
          #########              # ##                                          #######     
          ########               #                                            ########     
           #####   #                  #######                                    #######   
            ###                      #########                                   #####     
                                           ##                                   ####       
                                                                                #          `;

const 世界地図行List = 世界地図の文字列.split("\n");

let 世界地図基準列 = 0;
const 世界地図基準列_最大 = 世界地図行List[0].length - 1;

const 世界地図行RLEList = [];

for (const 世界地図行 of 世界地図行List) {
    let カウントしている文字 = " ";
    let count = 0;
    const rle = [];
    for (const 文字 of 世界地図行) {
        if (文字 === カウントしている文字) {
            count++;
        }
        else {
            rle.push(count);
            count = 1;
            if (カウントしている文字 === " ") {
                カウントしている文字 = "#";
            }
            else {
                カウントしている文字 = " ";
            }
        }
    }
    rle.push(count);
    世界地図行RLEList.push(rle);
}

const 円行文字数List = [10, 20, 28, 34, 40, 44, 46, 49, 51, 51, 53, 53, 53, 51, 51, 49, 46, 44, 40, 34, 28, 20, 10];

// for (const rle of 世界地図行RLEList) {
//     let 書く文字 = " ";
//     let text = "";
//     for (const 文字数 of rle) {
//         text += 書く文字.repeat(文字数);
//         if (書く文字 === " ") {
//             書く文字 = "#";
//         }
//         else {
//             書く文字 = " ";
//         }
//     }
//     console.log(text);
// }

if (世界地図行RLEList.length !== 円行文字数List.length) {
    throw "んにゃぴ";
}

const 最大幅 = Math.max(...円行文字数List);
for (let i = 0; i < 世界地図行RLEList.length; i++) {
    const 円行文字数 = 円行文字数List[i];
    const 世界地図行RLE = 世界地図行RLEList[i];
    let text = " ".repeat(Math.floor((最大幅 - 円行文字数) / 2));
    // text += "#".repeat(円行文字数);
    let 書く文字 = " ";
    for (const 文字数 of 世界地図行RLE) {
        const 円での文字数 = 文字数 * 
    }


    console.log(text);
}

